In [ ]:
#21. #21: Melakukan agregasi menggunakan agg()

In [1]:
import pandas as pd

In [ ]:
df = pd.read_csv('Iris.csv')
df

In [ ]:
# Mengenal groupby() dan fungsi agregasi
df.groupby('Species')['PetalLengthCm'].count().to_frame()
df.groupby('Species')['PetalLengthCm'].mean().to_frame()
df.groupby('Species')['PetalLengthCm'].median().to_frame()

In [ ]:
# Agregasi dengan agg()
df.groupby('Species')['PetalLengthCm'].agg(['count', 'mean', 'median'])

In [ ]:
# Agregasi dengan describe()
df.groupby('Species')['PetalLengthCm'].describe()

In [ ]:
#22 Memantau penggunaan memory suatu Data Frame

In [2]:
import pandas as pd

In [ ]:
#Persiapan Data Frame

df_titanic = pd.read_csv('titanicfull.csv')
df_titanic.head()

In [ ]:
df_iris = pd.read_csv('Iris.csv')
df_iris.head()

In [ ]:
#Memantau penggunaan memory suatu Data Frame
df_titanic.info(memory_usage='deep')

In [ ]:
df_iris.info(memory_usage='deep')

In [ ]:
#23. Seleksi baris pada Data Frame dengan query()

In [3]:
# Persiapan Data Frame

d = {'kolom_satu':[1, 2, 3, 4, 5], 
     'kolom dua':[10, 20, 30, 40, 50]}
df = pd.DataFrame(d)
df

   kolom_satu  kolom dua
0           1         10
1           2         20
2           3         30
3           4         40
4           5         50

In [6]:
# Seleksi baris dengan query()

df.query('kolom_satu > 2')

   kolom_satu  kolom dua
2           3         30
3           4         40
4           5         50

In [7]:
df.query('`kolom dua` > 30')

   kolom_satu  kolom dua
3           4         40
4           5         50

In [ ]:
#24. UTC dan konversi zona waktu (time zone) pada Python Pandas

In [8]:
# Persiapan Series
s = pd.Series(range(1591683521, 1592201921, 3600))
s = pd.to_datetime(s, unit='s')
s.head()

0   2020-06-09 06:18:41
1   2020-06-09 07:18:41
2   2020-06-09 08:18:41
3   2020-06-09 09:18:41
4   2020-06-09 10:18:41
dtype: datetime64[ns]

In [9]:
# Pengaturan zona waktu (time zone)
s = s.dt.tz_localize('UTC')
s.head()

0   2020-06-09 06:18:41+00:00
1   2020-06-09 07:18:41+00:00
2   2020-06-09 08:18:41+00:00
3   2020-06-09 09:18:41+00:00
4   2020-06-09 10:18:41+00:00
dtype: datetime64[ns, UTC]

In [10]:
s = s.dt.tz_convert('Asia/Jakarta')
s.head()

0   2020-06-09 13:18:41+07:00
1   2020-06-09 14:18:41+07:00
2   2020-06-09 15:18:41+07:00
3   2020-06-09 16:18:41+07:00
4   2020-06-09 17:18:41+07:00
dtype: datetime64[ns, Asia/Jakarta]

In [11]:
s = s.dt.tz_convert('Australia/Hobart')
s.head()

0   2020-06-09 16:18:41+10:00
1   2020-06-09 17:18:41+10:00
2   2020-06-09 18:18:41+10:00
3   2020-06-09 19:18:41+10:00
4   2020-06-09 20:18:41+10:00
dtype: datetime64[ns, Australia/Hobart]